Repository: luisvinatea/AeraSync
Catalog: lib/l10n/app_*.arb
Languages: es, pt

# languageEnglish
source: English
es: Inglés
pt: Inglês

# languageSpanish
source: Spanish
es: Español
pt: Espanhol

# languagePortuguese
source: Portuguese
es: Portugués
pt: Português

# changeLanguageTooltip
source: Switch language for a personalized experience
es: Cambia el idioma para una experiencia personalizada
pt: Mude o idioma para uma experiência personalizada

# dataDisclosureMessage
source: We collect anonymous usage data to improve the app. Please review our privacy policy.
es: Recolectamos datos de uso anónimos para mejorar la aplicación. Por favor, revisa nuestra política de privacidad.
pt: Coletamos dados de uso anônimos para melhorar o aplicativo. Por favor, revise nossa política de privacidade.

source: Learn More
es: Saber Más
pt: Saiba Mais

# privacyPolicyLink
source: View Privacy Policy
es: Ver Política de Privacidad
pt: Ver Política de Privacidade

# disagreeMessage
source: You must agree to the data disclosure to use the app
es: Debes aceptar la divulgación de datos para usar la aplicación
pt: Você deve concordar com a divulgação de dados para usar o aplicativo

source: Error
pt: Erro

source: Aerator Details
es: Detalles del Aireador
pt: Detalhes do Aerador

# farmAndOxygenDemand
source: Farm Specs & Oxygen Demand
es: Granja y Demanda de Oxígeno
pt: Fazenda e Demanda de Oxigênio

source: Financial Aspects
es: Aspectos Financieros
pt: Aspectos Financeiros

source: Back
es: Atrás
pt: Voltar

source: Next
es: Siguiente
pt: Próximo

source: Submit
es: Enviar
pt: Enviar

source: Add Aerator
es: Agregar Aireador
pt: Adicionar Aerador

# aeratorLabel
source: Aerator
es: Aireador
pt: Aerador

# aeratorTypeLabel
source: Aerator Type (Optional)
es: Tipo de Aireador (Opcional)
pt: Tipo de Aerador (Opcional)

# aeratorTypeTooltip
source: Type of aerator (e.g., paddlewheel, aspirator)
es: Tipo de aireador (por ejemplo, rueda de paletas, difusor)
pt: Tipo de aerador (por exemplo, roda de pás, difusor)

# horsepowerLabel
source: Horsepower (HP)
es: Caballos de Fuerza (hp)
pt: Potência (hp)

# horsepowerTooltip
source: Aerator power in horsepower (0.1 to 100 HP)
es: Potencia del aireador en caballos de fuerza (0.1 a 100)
pt: Potência do aerador em cavalos de força (0.1 a 100)

# sotrTooltip
source: Standard Oxygen Transfer Rate (0.1 to 10 kg O₂/h) as provided by supplier
es: Tasa de Transferencia de Oxígeno Estándar por hora (0.1 a 10)
pt: Taxa de Transferência de Oxigênio Padrão por hora (0.1 a 10)

# priceLabel
source: Price (USD)
es: Precio (USD)
pt: Preço (USD)

# durabilityLabel
source: Durability (years)
es: Durabilidad (años)
pt: Durabilidade (anos)

# maintenanceCostLabel
source: Maintenance Cost (USD/year)
es: Costo Anual de Mantenimiento (USD)
pt: Custo Anual de Manutenção (USD)

# farmAreaLabel
source: Farm Area (ha)
es: Área Total de la Granja (ha)
pt: Área Total da Fazenda (ha)

# farmAreaTooltip
source: Total area of the farm (0.1 to 100000 ha)
es: Área total de la granja en hectáreas (0.1 a 100000)
pt: Área total da fazenda em hectares (0.1 a 100000)

# productionPerHaLabel
source: Production per Hectare (kg/ha)
es: Producción por Hectárea (kg/ha/año)
pt: Produção por Hectare (kg/ha/ano)

# productionPerHaTooltip
source: Total shrimp production per hectare (0 to 100000 kg/ha)
es: Producción anual de camarones por hectárea (0 a 100000)
pt: Produção anual de camarões por hectare (0 a 100000)

# cyclesPerYearLabel
source: Cycles per Year
es: Ciclos por Año
pt: Ciclos por Ano

# cyclesPerYearTooltip
source: Number of production cycles per year (1 to 10)
es: Número de ciclos de producción por año (1 a 10)
pt: Número de ciclos de produção por ano (1 a 10)

# waterTemperatureLabel
source: Water Temperature (°C)
es: Temperatura del Agua (°C)
pt: Temperatura da Água (°C)

# waterTemperatureTooltip
source: Temperature of the pond water (0 to 40 °C)
es: Temperatura promedio del agua en Celsius (0 a 40)
pt: Temperatura média da água em Celsius (0 a 40)

# salinityLabel
source: Salinity (ppt)
es: Salinidad (ppt)
pt: Salinidade (ppt)

# salinityTooltip
source: Salinity of the water in parts per thousand (0 to 40 ppt)
es: Salinidad del agua en partes por mil (0 a 40)
pt: Salinidade da água em partes por mil (0 a 40)

# pondDepthLabel
source: Pond Depth (m)
es: Profundidad del Estanque (m)
pt: Profundidade do Tanque (m)

# pondDepthTooltip
source: Depth of the pond (0.5 to 5 m)
es: Profundidad promedio de los estanques en metros (0.5 a 5)
pt: Profundidade média dos tanques em metros (0.5 a 5)

# averageShrimpWeightLabel
source: Average Shrimp Weight (g)
es: Peso Promedio del Camarón (g)
pt: Peso Médio do Camarão (g)

# averageShrimpWeightTooltip
source: Average weight of shrimp (0 to 50 g)
es: Peso promedio del camarón en gramos (0 a 50)
pt: Peso médio do camarão em gramas (0 a 50)

# shrimpBiomassLabel
source: Shrimp Biomass (kg/ha)
es: Biomasa de Camarones (kg/ha)
pt: Biomassa de Camarões (kg/ha)

# shrimpBiomassTooltip
source: Total shrimp biomass per hectare (0 to 100000 kg/ha)
es: Biomasa de camarones por hectárea (0 a 100000)
pt: Biomassa de camarões por hectare (0 a 100000)

# safetyMarginLabel
source: Safety Margin
es: Margen de Seguridad (%)
pt: Margem de Segurança (%)

# safetyMarginTooltip
source: Factor to account for unexpected oxygen demand (1 to 2)
es: Margen de seguridad opcional para cálculos (0 a 100)
pt: Margem de segurança opcional para cálculos (0 a 100)

# shrimpPriceLabel
source: Shrimp Price (USD/kg)
es: Precio del Camarón (USD/kg)
pt: Preço do Camarão (USD/kg)

# shrimpPriceTooltip
source: Market price of shrimp per kg (0.1 to 50 USD)
es: Precio de mercado del camarón por kilogramo (0.1 a 50)
pt: Preço de mercado do camarão por kilogramo (0.1 a 50)

# electricityCostLabel
source: Electricity Cost (USD/kWh)
es: Costo de Electricidad (USD/kWh)
pt: Custo de Eletricidade (USD/kWh)

# electricityCostTooltip
source: Cost of electricity per kWh (0 to 1 USD)
es: Costo de electricidad por kilovatio-hora (0 a 1)
pt: Custo de eletricidade por kilovatio-hora (0 a 1)

# operatingHoursLabel
source: Operating Hours (h/day)
es: Horas de Operación por Año
pt: Horas de Operação por Ano

# operatingHoursTooltip
source: Number of hours aerators operate per day (1 to 24)
es: Total de horas que los aireadores operan por año (0 a 8760)
pt: Total de horas que os aeradores operam por ano (0 a 8760)

# discountRateLabel
source: Discount Rate (%)
es: Tasa de Descuento (%)
pt: Tasa de Desconto (%)

# discountRateTooltip
source: Discount rate for NPV calculation (0 to 100%)
es: Tasa de descuento para cálculos financieros (0 a 100)
pt: Tasa de desconto para cálculos financeiros (0 a 100)

# inflationRateLabel
source: Inflation Rate (%)
es: Tasa de Inflación (%)
pt: Tasa de Inflação (%)

# inflationRateTooltip
source: Expected annual inflation rate (0 to 100%)
es: Tasa de inflación anual (0 a 100)
pt: Tasa de inflação anual (0 a 100)

# analysisHorizonLabel
source: Analysis Horizon (years)
es: Horizonte de Análisis (años)
pt: Horizonte de Análise (anos)

# analysisHorizonTooltip
source: Number of years for financial analysis (1 to 50)
es: Período de tiempo para el análisis financiero (1 a 50)
pt: Período de tempo para o análise financeira (1 a 50)

# dataCollectionConsentLabel
source: I consent to my data being collected securely for research purposes, in accordance with applicable laws
es: Doy mi consentimiento para la recolección de datos para análisis
pt: Dou meu consentimento para a coleta de dados para análise

# consentRequiredError
source: Consent is required to proceed
es: El consentimiento para la recolección de datos es obligatorio
pt: O consentimento para a coleta de dados é obrigatório

# minimumAeratorsError
source: At least two aerators are required
es: Se requieren al menos dos aireadores
pt: É necessário ter pelo menos dois aireadores

# requiredField
source: This field is required
es: Este campo es obligatorio
pt: Este campo é obrigatório

# invalidNumber
source: Please enter a valid number
es: Por favor, ingresa un número válido
pt: Por favor, insira um número válido

# rangeError
source: Value must be between {min} and {max}
es: El valor debe estar entre {min} y {max}
pt: O valor deve estar entre {min} e {max}

source: Results
es: Resultados
pt: Resultados

source: Summary Metrics
es: Métricas Resumidas
pt: Métricas Resumidas

source: Recommended Aerator
es: Aireador Recomendado
pt: Aireador Recomendado

source: Aerator Comparison Results
es: Resultados de Comparación de Aireadores
pt: Resultados de Comparação de Aireadores

source: Oxygen Demand Breakdown
es: Desglose de la Demanda de Oxígeno
pt: Resumo da Demanda de Oxigênio

# totalDemandLabel
source: Total Demand
es: Demanda Total de Oxígeno
pt: Demanda Total de Oxigênio

# shrimpRespirationLabel
source: Shrimp Respiration (mg/L/h)
es: Respiración de Camarones
pt: Respiração de Camarões

# annualRevenueLabel
source: Annual Revenue
es: Ingresos Anuales
pt: Receita Anual

source: Units Needed
es: Unidades Necesarias
pt: Unidades Necessárias

# totalAnnualCostLabel
source: Total Annual Cost (USD)
es: Costo Anual Total
pt: Custo Anual Total

# costPercentage
source: Cost as % of Revenue
es: Porcentaje de Costo
pt: Porcentagem de Custo

# npvLabel
source: NPV (USD)
es: VPN
pt: VPN

# irrLabel
source: IRR (%)
es: TIR
pt: TIR

source: Payback Period
es: Período de Recuperación
pt: Período de Recuperação

source: Detailed Financial Metrics
es: Métricas Financieras Detalladas
pt: Métricas Financeiras Detalhadas

# equilibriumPriceP2Label
source: Equilibrium Price (Aerator 2)
es: Precio de Equilibrio (P2)
pt: Preço de Equilíbrio (P2)

source: Annual Savings
es: Ahorros Anuales
pt: Economias Anuais

source: No data available
es: No hay datos disponibles
pt: Não há dados disponíveis

source: Download Report
es: Descargar Informe en PDF
pt: Baixar Relatório em PDF

source: Download CSV
es: Descargar CSV
pt: Baixar CSV

# csvExportNotSupported
source: CSV export not supported on this platform
es: La exportación a CSV no es compatible con esta plataforma
pt: A exportação para CSV não é compatível com esta plataforma

# pdfGenerationFailed
source: Failed to generate PDF
es: Error al generar el PDF: {error}
pt: Erro ao gerar o PDF: {error}
