Repository: luisvinatea/AeraSync
Catalog: frontend/lib/l10n/app_*.arb
Languages: pt

source: Welcome to AeraSync
pt: Bem-vindo à AeraSync

source: Start Survey
pt: Iniciar Pesquisa

source: Select Language
pt: Selecionar idioma

# apiUnreachable
source: Unable to connect to the server. Please try again later.
pt: Não foi possível conectar ao servidor. Por favor, tente novamente mais tarde.

source: Retry
pt: Repetir

source: Data Disclosure
pt: Divulgação de Dados

# dataDisclosureMessage
source: The data collected in this survey will be used to improve the AeraSync application and provide better recommendations. Your data will be kept confidential and will not be shared with third parties.
pt: Recopilamos dados de uso anônimos para melhorar a aplicação.

# agree
source: I Agree
pt: Aceitar

source: Learn More
pt: Saiba mais

source: Error
pt: Erro

source: Dismiss
pt: Descartar

source: Survey
pt: Pesquisa

source: Farm and Oxygen Demand
pt: Demanda de Oxigênio da Fazenda

source: Aerator Details
pt: Detalhes do Aerador

source: Financial Aspects
pt: Aspectos Financeiros

source: Back
pt: Voltar

source: Next
pt: Próximo

source: Submit
pt: Enviar

source: Aerator
pt: Aerador

source: Total Oxygen Demand
pt: Demanda Total de Oxigênio

# nameLabel
source: Aerator Name
pt: Nome do Aerador

# horsepowerLabel
source: Horsepower (hp)
pt: Potência (hp)

# sotrLabel
source: SOTR (kg Oݞ/h)
pt: SOTR (kg O₂/h)

# priceLabel
source: Price (USD)
pt: Preço (USD)

# durabilityLabel
source: Durability (years)
pt: Durabilidade (anos)

# maintenanceCostLabel
source: Annual Maintenance Cost (USD)
pt: Custo de Manutenção Anual (USD)

# farmAreaLabel
source: Total Farm Area (ha)
pt: Área Total da Fazenda (ha)

# pondDepthLabel
source: Pond Depth (m)
pt: Profundidade do Estanque (m)

# safetyMarginLabel
source: Safety Margin (%)
pt: Margem de Segurança (%)

# shrimpPriceLabel
source: Shrimp Price (USD/kg)
pt: Preço dos Camarões (USD/kg)

# discountRateLabel
source: Discount Rate (%)
pt: Taxa de Desconto (%)

# inflationRateLabel
source: Inflation Rate (%)
pt: Taxa de Inflação (%)

# analysisHorizonLabel
source: Analysis Horizon (years)
pt: Horizonte de Análise (anos)

# requiredField
source: This field is required
pt: Este campo é obrigatório

# invalidNumber
source: Please enter a valid number
pt: Por favor, insira um número válido

# rangeError
source: Value must be between {min} and {max}
pt: O valor deve estar entre {min} e {max}

# submissionFailed
source: Failed to submit survey: {error}
pt: Erro ao enviar a pesquisa: {error}

source: Results
pt: Resultados

source: Summary Metrics
pt: Métricas Resumidas

# totalDemandLabel
source: Total Oxygen Demand
pt: Demanda Total de Oxigênio

source: Recommended Aerator
pt: Aerador Recomendado

source: Aerator Comparison Results
pt: Resultados de Comparação de Aireadores

source: Equilibrium Prices
pt: Preços de Equilíbrio

# equilibriumPriceLabel
source: Equilibrium Price
pt: Preço de Equilíbrio

# noEquilibriumPrices
source: No equilibrium prices available
pt: ão há preços de equilíbrio disponíveis

# aeratorLabel
source: Aerator
pt: Aerador

source: Units Needed
pt: Unidades Necessárias

# initialCostLabel
source: Initial Cost
pt: Custo Inicial

# annualEnergyCostLabel
source: Annual Energy Cost
pt: Custo Anual de Energia

# annualMaintenanceCostLabel
source: Annual Maintenance Cost
pt: Custo Anual de Manutenção

# npvCostLabel
source: NPV Cost
pt: Custo VPL

# saeLabel
source: SAE (kg Oݞ/kWh)
pt: SAE (kg O₂/kWh)

source: Payback Period
pt: Período de Recuperação

# irrLabel
source: IRR
pt: TIR

source: Profitability Coefficient
pt: Coeficiente de Rentabilidade

source: No data available
pt: Não há dados disponíveis

# summaryMetricsDescription
source: Summary metrics for aerator comparison
pt: Descrição de métricas resumidas para a comparação de aireadores

# aeratorComparisonResultsDescription
source: Comparison table of aerator results
pt: Descrição da tabela de comparação de aireadores

# equilibriumPricesDescription
source: Equilibrium prices for non-recommended aerators
pt: Descrição de preços de equilíbrio para aireadores não recomendados

# noDataAvailableDescription
source: No data available to display
pt: Não há dados disponíveis para mostrar

# minimumValueError
source: Please enter a value greater than or equal to {value}
pt: Favor inserir um valor maior ou igual a {value}

# optionalField
source: Optional
pt: Opcional

# surveyError
source: Error submitting survey
pt: Erro ao enviar a pesquisa

# todLabel
source: Total Oxygen Demand (kg Oݞ/ha)
pt: Demanda Total de Oxigênio (kg O₂/ha)

# costLabel
source: Cost
pt: Custo (USD)

# npvSavingsLabel
source: NPV Savings
pt: Poupança de VPL

# cultureDaysLabel
source: Culture Days
pt: Dias de Cultivo

# temperatureLabel
source: Water Temperature
pt: Temperatura da Água

# surveySubmissionSuccessful
source: Survey submission was successful
pt: A pesquisa foi enviada com sucesso
